In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [4]:
import pandas as pd
import io
#data = pd.read_csv(io.BytesIO(uploaded['housing.csv']))
data = pd.read_csv('Housing.csv')
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 545 entries, 0 to 544
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   price             545 non-null    int64
 1   area              545 non-null    int64
 2   bedrooms          545 non-null    int64
 3   bathrooms         545 non-null    int64
 4   stories           545 non-null    int64
 5   mainroad          545 non-null    object
 6   guestroom         545 non-null    object
 7   basement          545 non-null    object
 8   hotwaterheating   545 non-null    object
 9   airconditioning   545 non-null    object
 10  parking           545 non-null    int64
 11  prefarea          545 non-null    object
 12  furnishingstatus  545 non-null    object
dtypes: int64(6), object(7)
memory usage: 55.5+ KB

In [5]:
data.head()

      price  area  bedrooms  ...  parking  prefarea furnishingstatus
0  13300000  7420         4  ...        2       yes        furnished
1  12250000  8960         4  ...        3        no        furnished
2  12250000  9960         3  ...        2       yes   semi-furnished
3  12215000  7500         4  ...        3       yes        furnished
4  11410000  7420         4  ...        2        no        furnished

[5 rows x 13 columns]

In [ ]:
Encoding

(1)Label encoder

(2)Onehot encoder

In [7]:
from sklearn.preprocessing import LabelEncoder , OneHotEncoder
data['price'].value_counts()

4200000     17
3500000     17
4900000     12
5250000      9
3150000      9
            ..
11410000     1
8680000      1
6419000      1
8080940      1
8960000      1
Name: price, Length: 219, dtype: int64

(1)Label encoder

In [8]:
le=LabelEncoder()
data['price']=le.fit_transform(data['price'])
data['price'].value_counts()

54     17
81     17
110    12
40      9
135     9
       ..
162     1
86      1
88      1
89      1
218     1
Name: price, Length: 219, dtype: int64

In [9]:
le.classes_

array([ 1750000,  1767150,  1820000,  1855000,  1890000,  1960000,
        2100000,  2135000,  2233000,  2240000,  2275000,  2310000,
        2345000,  2380000,  2408000,  2450000,  2485000,  2520000,
        2590000,  2604000,  2653000,  2660000,  2695000,  2730000,
        2800000,  2835000,  2852500,  2870000,  2940000,  2961000,
        2975000,  3003000,  3010000,  3045000,  3080000,  3087000,
        3115000,  3118850,  3129000,  3143000,  3150000,  3220000,
        3234000,  3255000,  3290000,  3325000,  3332000,  3353000,
        3360000,  3395000,  3423000,  3430000,  3465000,  3493000,
        3500000,  3535000,  3570000,  3605000,  3633000,  3640000,
        3675000,  3703000,  3710000,  3745000,  3773000,  3780000,
        3815000,  3836000,  3850000,  3885000,  3920000,  3990000,
        4007500,  4025000,  4060000,  4095000,  4098500,  4123000,
        4130000,  4165000,  4193000,  4200000,  4235000,  4270000,
        4277000,  4305000,  4319000,  4340000,  4375000,  4382000,
        4403000,  4410000,  4445000,  4473000,  4480000,  4515000,
        4543000,  4550000,  4585000,  4613000,  4620000,  4655000,
        4690000,  4753000,  4760000,  4767000,  4795000,  4830000,
        4865000,  4893000,  4900000,  4907000,  4935000,  4956000,
        4970000,  5005000,  5033000,  5040000,  5075000,  5110000,
        5145000,  5215000,  5229000,  5243000,  5250000,  5285000,
        5320000,  5383000,  5390000,  5425000,  5460000,  5495000,
        5523000,  5530000,  5565000,  5600000,  5652500,  5740000,
        5775000,  5803000,  5810000,  5866000,  5873000,  5880000,
        5943000,  5950000,  6020000,  6083000,  6090000,  6107500,
        6125000,  6160000,  6195000,  6230000,  6265000,  6293000,
        6300000,  6405000,  6419000,  6440000,  6475000,  6510000,
        6580000,  6615000,  6629000,  6650000,  6685000,  6720000,
        6755000,  6790000,  6860000,  6895000,  6930000,  7000000,
        7035000,  7070000,  7140000,  7210000,  7245000,  7343000,
        7350000,  7420000,  7455000,  7490000,  7525000,  7560000,
        7700000,  7840000,  7875000,  7910000,  7962500,  7980000,
        8043000,  8080940,  8120000,  8190000,  8295000,  8400000,
        8463000,  8540000,  8575000,  8645000,  8680000,  8750000,
        8855000,  8890000,  8960000,  9100000,  9240000,  9310000,
        9681000,  9800000,  9870000, 10150000, 10850000, 11410000,
       12215000, 12250000, 13300000])

(2)Onehot Encoder

In [10]:

data['bedrooms'].value_counts()

3    300
2    136
4     95
5     10
6      2
1      2
Name: bedrooms, dtype: int64

In [11]:
one_hot = OneHotEncoder()
transformed_data = one_hot.fit_transform(data['bedrooms'].values.reshape(-1,1)).toarray()
one_hot.categories_

[array([1, 2, 3, 4, 5, 6])]

In [12]:
transformed_data = pd.DataFrame(transformed_data , 
                                columns = ['1', '2', '3', '4','5' ,' 6'])
transformed_data.head()

     1    2    3    4    5    6
0  0.0  0.0  0.0  1.0  0.0  0.0
1  0.0  0.0  0.0  1.0  0.0  0.0
2  0.0  0.0  1.0  0.0  0.0  0.0
3  0.0  0.0  0.0  1.0  0.0  0.0
4  0.0  0.0  0.0  1.0  0.0  0.0

In [13]:
transformed_data.iloc[90, ]

1     0.0
2     0.0
3     1.0
4     0.0
5     0.0
 6    0.0
Name: 90, dtype: float64

In [14]:
data['price'][90]

159

In [15]:
numeric_columns = [c for c in data.columns if data[c].dtype != np.dtype('O')]
numeric_columns

['price', 'area', 'bedrooms', 'bathrooms', 'stories', 'parking']

In [16]:
len(numeric_columns) , len(data.columns)

(6, 13)

In [17]:
temp_data = data[numeric_columns]
temp_data

     price  area  bedrooms  bathrooms  stories  parking
0      218  7420         4          2        3        2
1      217  8960         4          4        4        3
2      217  9960         3          2        2        2
3      216  7500         4          2        2        3
4      215  7420         4          1        2        2
..     ...   ...       ...        ...      ...      ...
540      2  3000         2          1        1        2
541      1  2400         3          1        1        0
542      0  3620         2          1        1        0
543      0  2910         3          1        1        0
544      0  3850         3          1        2        0

[545 rows x 6 columns]

In [18]:
from sklearn.preprocessing import StandardScaler , MinMaxScaler
import warnings
warnings.filterwarnings('ignore')
normalizer = MinMaxScaler()
temp_data.dropna(axis = 1 , inplace = True)
normalized_data = normalizer.fit_transform(temp_data)
pd.DataFrame(normalized_data , columns = temp_data.columns)

        price      area  bedrooms  bathrooms   stories   parking
0    1.000000  0.396564       0.6   0.333333  0.666667  0.666667
1    0.995413  0.502405       0.6   1.000000  1.000000  1.000000
2    0.995413  0.571134       0.4   0.333333  0.333333  0.666667
3    0.990826  0.402062       0.6   0.333333  0.333333  1.000000
4    0.986239  0.396564       0.6   0.000000  0.333333  0.666667
..        ...       ...       ...        ...       ...       ...
540  0.009174  0.092784       0.2   0.000000  0.000000  0.666667
541  0.004587  0.051546       0.4   0.000000  0.000000  0.000000
542  0.000000  0.135395       0.2   0.000000  0.000000  0.000000
543  0.000000  0.086598       0.4   0.000000  0.000000  0.000000
544  0.000000  0.151203       0.4   0.000000  0.333333  0.000000

[545 rows x 6 columns]

Standardization

In [19]:
standard_scaler = StandardScaler()
standardized_data = standard_scaler.fit_transform(temp_data)
pd.DataFrame(standardized_data , columns = temp_data.columns)

        price      area  bedrooms  bathrooms   stories   parking
0    2.175477  1.046726  1.403419   1.421812  1.378217  1.517692
1    2.157685  1.757010  1.403419   5.405809  2.532024  2.679409
2    2.157685  2.218232  0.047278   1.421812  0.224410  1.517692
3    2.139893  1.083624  1.403419   1.421812  0.224410  2.679409
4    2.122101  1.046726  1.403419  -0.570187  0.224410  1.517692
..        ...       ...       ...        ...       ...       ...
540 -1.667633 -0.991879 -1.308863  -0.570187 -0.929397  1.517692
541 -1.685425 -1.268613  0.047278  -0.570187 -0.929397 -0.805741
542 -1.703217 -0.705921 -1.308863  -0.570187 -0.929397 -0.805741
543 -1.703217 -1.033389  0.047278  -0.570187 -0.929397 -0.805741
544 -1.703217 -0.599839  0.047278  -0.570187  0.224410 -0.805741

[545 rows x 6 columns]

Handling With Missing Values

In [20]:
data.isnull().sum()

price               0
area                0
bedrooms            0
bathrooms           0
stories             0
mainroad            0
guestroom           0
basement            0
hotwaterheating     0
airconditioning     0
parking             0
prefarea            0
furnishingstatus    0
dtype: int64

In [21]:
data['bedrooms'].isnull().sum()

0

Simple Imputer

In [22]:
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(missing_values=np.nan , strategy='mean')
agent_col = imputer.fit_transform(data['bedrooms'].values.reshape(-1,1))
pd.DataFrame(agent_col).isnull().sum()

0    0
dtype: int64

In [24]:
data['bedrooms'].isnull().sum()

0

In [25]:
from sklearn.preprocessing import KBinsDiscretizer
temp_data.head()

   price  area  bedrooms  bathrooms  stories  parking
0    218  7420         4          2        3        2
1    217  8960         4          4        4        3
2    217  9960         3          2        2        2
3    216  7500         4          2        2        3
4    215  7420         4          1        2        2

Quantile Discretization Transform

In [26]:
trans = KBinsDiscretizer(n_bins =10 , encode = 'ordinal' , strategy='quantile')
new_data = trans.fit_transform(temp_data)
pd.DataFrame(new_data,columns = temp_data.columns )

     price  area  bedrooms  bathrooms  stories  parking
0      9.0   8.0       3.0        1.0      2.0      2.0
1      9.0   9.0       3.0        1.0      2.0      2.0
2      9.0   9.0       2.0        1.0      1.0      2.0
3      9.0   8.0       3.0        1.0      1.0      2.0
4      9.0   8.0       3.0        0.0      1.0      2.0
..     ...   ...       ...        ...      ...      ...
540    0.0   1.0       1.0        0.0      0.0      2.0
541    0.0   0.0       2.0        0.0      0.0      0.0
542    0.0   2.0       1.0        0.0      0.0      0.0
543    0.0   0.0       2.0        0.0      0.0      0.0
544    0.0   3.0       2.0        0.0      1.0      0.0

[545 rows x 6 columns]

In [27]:
trans = KBinsDiscretizer(n_bins =10 , encode = 'ordinal' , strategy='uniform')
new_data = trans.fit_transform(temp_data)

pd.DataFrame(new_data,columns = temp_data.columns )

     price  area  bedrooms  bathrooms  stories  parking
0      9.0   3.0       6.0        3.0      6.0      6.0
1      9.0   5.0       6.0        9.0      9.0      9.0
2      9.0   5.0       4.0        3.0      3.0      6.0
3      9.0   4.0       6.0        3.0      3.0      9.0
4      9.0   3.0       6.0        0.0      3.0      6.0
..     ...   ...       ...        ...      ...      ...
540    0.0   0.0       2.0        0.0      0.0      6.0
541    0.0   0.0       4.0        0.0      0.0      0.0
542    0.0   1.0       2.0        0.0      0.0      0.0
543    0.0   0.0       4.0        0.0      0.0      0.0
544    0.0   1.0       4.0        0.0      3.0      0.0

[545 rows x 6 columns]

KMeans Discretization Transform

In [28]:
trans = KBinsDiscretizer(n_bins =10 , encode = 'ordinal' , strategy='kmeans')
new_data = trans.fit_transform(temp_data)

pd.DataFrame(new_data,columns = temp_data.columns )

     price  area  bedrooms  bathrooms  stories  parking
0      9.0   5.0       4.0        1.0      2.0      2.0
1      9.0   6.0       4.0        3.0      3.0      3.0
2      9.0   6.0       3.0        1.0      1.0      2.0
3      9.0   5.0       4.0        1.0      1.0      3.0
4      9.0   5.0       4.0        0.0      1.0      2.0
..     ...   ...       ...        ...      ...      ...
540    0.0   0.0       1.0        0.0      0.0      2.0
541    0.0   0.0       3.0        0.0      0.0      0.0
542    0.0   1.0       1.0        0.0      0.0      0.0
543    0.0   0.0       3.0        0.0      0.0      0.0
544    0.0   1.0       3.0        0.0      1.0      0.0

[545 rows x 6 columns]